<template>
    <div>
        <el-breadcrumb separator="/">
            <el-breadcrumb-item>首页</el-breadcrumb-item>
            <el-breadcrumb-item>Index</el-breadcrumb-item>
        </el-breadcrumb>
        <div class="main">
        <el-tabs v-model="help">
            <el-tab-pane label="上传说明" name="upload">
                <p>每位同学最多推荐10首歌曲，<strong>上传前请确认您推荐的歌曲在同一时段尚未有人推荐</strong>，尽量不要重复上传。<p>
                <p>此外，<strong>应德育处要求，希望大家踊跃上传优秀的国产歌曲</strong>。</p>

                <h3>手动上传:</h3>
                <p>音频格式只能为 mp3，并请保证有一定质量。歌曲时间控制在3-5分钟，大小介于1MB-15MB为宜，禁止上传超过20MB的歌曲。</p>
                <p>此外，曲目<strong>不得带有非伴奏性人声</strong>。同时，请各位在挑选音乐的时候明确自己对全体师生的责任，在依据自身审美标准的同时考虑广大人民群众的需求。</p>
                <p>在提交新曲目时，需要参考各时段音乐要求选择一个推荐的播放时段，并填入曲名。“来源”一项表示此曲目的出处，可以填写该曲目来自的专辑、音乐家或节目、游戏等，<strong>不是表示上传者</strong>。如果不明来源可留空。上传时<strong>请先填写信息再上传文件</strong>。</p>
                <hr/>

                <h3>网易云音乐上传:</h3>
                <p>请在搜索框内输入要搜索的歌曲名称，按回车键或点击右侧搜索按钮进行搜索，选择曲目时请确保歌曲不带有非伴奏性人声，否则一经发现将直接删除。<p>
                <p>搜索结果加载完毕后请根据歌曲信息找到您要推荐的曲目，点击后侧">"符号展开表单，"曲名"和"来源"两项可根据歌曲信息在下拉框中选择，其中"来源"一项将给出歌曲名称和专辑名称两个选项，如您发现歌曲信息不准确亦可手动输入或进行修改。</p>

                <hr/>
                <p>出于公平性考虑，本次征集投票时将隐藏歌曲信息，因此将预先进行审核，对于严重恶搞、不符合要求、以及重复上传的内容，将直接删除。如果投票过程中发现上述情况，请点击播放器左下方的举报按钮进行举报，我们会尽快处理。此外，出于同样目的，上传时曲目的标签信息将被删除。但此操作耗时较多，因此上传进度到达100%后可能出现几秒的停顿，请耐心等待。</p>
            </el-tab-pane>
            <el-tab-pane label="投票说明" name="vote">
                <p>开始播放后15秒将会显示打分栏，请综合您的感受及歌曲所在时段的音乐要求进行评价，选择"1星 - 非常不合适"、"2星 - 不合适"、"3星 - 中立"、"4星 - 合适"或"5星 - 非常合适"，然后点击提交按钮进行提交。</p>
                <p>提交投票后仍可对评价进行更改并再次提交。</p>
                <p>若已对歌曲进行打分但未提交，播放完毕后将会自动提交。</p>
                <p>为保证公平性，投票时的歌曲列表经过随机排列。<strong>请勿根据过于强烈的主观感受进行评价，禁止恶意投票、拉票等违规行为</strong>，一经发现将采取相应措施。</p>
            </el-tab-pane>
            <el-tab-pane label="各时段音乐要求" name="requirement">
                <p>上传时请根据歌曲特征推荐播放时段，投票时请参考歌曲所在时段的音乐要求进行评价。</p>

                <ol>
                    <li>起床音乐：能使人逐渐清醒，最重要的是最好不要有催眠效果。</li>
                    <li>早出门音乐：一定要能使同学们清醒！</li>
                    <li>午出门音乐：能提醒午睡的同学及时起床，同时不要给在班上的同学带来太大噪音。</li>
                    <li>晚出门音乐：暂时没有额外要求。</li>
                    <li>自习结束音乐：暂时没有额外要求。</li>
                    <li>熄灯音乐：能让想睡的人睡觉，让想夜读的人能继续夜读。</li>
                </ol>
            </el-tab-pane>
        </el-tabs>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                help: 'upload'
            }
        }
    };
</script>