<template>
    <div>
        <el-breadcrumb separator="/">
            <el-breadcrumb-item>首页</el-breadcrumb-item>
            <el-breadcrumb-item>Index</el-breadcrumb-item>
        </el-breadcrumb>
        <div class="main">
            <h2>审核须知</h2>
                <p>感谢参与校园音乐审核工作，审核前请仔细阅读以下注意事项。</p>
                <p>审核流程：初步筛选(删除不符合硬性规定的曲目) -> 二次筛选(根据各时段曲目要求筛选掉不符合要求的曲目，移至回收站) -> 核查&复查 -> 精选(每一时段留下10首左右精选曲目，供公开投票使用)</p>
                <hr/>

                <h3>硬性规定：</h3>
                <ol>
                    <li>曲目<strong>不得带有非伴奏性人声</strong>(最好不带有任何人声，以免影响播放效果)。</li>
                    <li>严禁恶搞类歌曲，包括但不仅限于不符合现代中学生审美的歌曲，如《北京的金山上》、《东方红》。</li>
                    <li>歌曲需能被大多数同学所接受，不符合此类要求的歌曲包括但不仅限于节奏过于劲爆的歌曲，过于刺耳的重金属音乐等等。</li>
                    <li>同一时段内不得出现重复的曲目，上传时仅对同一文件进行了限制，如为同一曲目的不同版本请斟酌后选出最适宜的一个版本，其余版本移至回收站。</li>
                </ol>
                <hr/>

                <h3>基本要求：</h3>
                <p>基本符合各时段音乐要求，如下：<p>
                <ol>
                    <li>起床音乐：能使人逐渐清醒，最重要的是最好不要有催眠效果。</li>
                    <li>早出门音乐：一定要能使同学们清醒！</li>
                    <li>午出门音乐：能提醒午睡的同学及时起床，同时不要给在班上的同学带来太大噪音。</li>
                    <li>晚出门音乐：暂时没有额外要求。</li>
                    <li>自习结束音乐：暂时没有额外要求。</li>
                    <li>熄灯音乐：能让想睡的人睡觉，让想夜读的人能继续夜读。</li>
                </ol>
                <hr/>

                <h3>额外要求&提示：</h3>
                <ol>
                    <li>同一时段内尽量不要出现过多同一来源的歌曲，尽量不超过3首。</li>
                    <li>应德育处要求，鼓励优秀的国产歌曲，保证国产歌曲占比。</li>
                    <li>审核者删除的歌曲均被移入回收站，歌曲文件不会彻底删除，以免发生意外事故，核查&复查阶段由管理员从回收站彻底删除，开放投票期间回收站不会留有任何曲目。</li>
                    <li>审核的最终目的在于每一时段精选10首左右歌曲以节省公开投票时间，原则上审核结束后每一时段歌曲不超过10首，但如有本校学生原创歌曲不计入10首限制内。</li>
                </ol>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
            }
        }
    };
</script>
